const rulesData = [
  {
    number: 1,
    title: "Правила для громадян",
    articles: [
      {
        title: "Стаття 1.1. Статус громадянина",
        text: "Кожний гравець є повноціним RolePlay - громадянином сервера. Гравець зобов'язаний дотримуватися правил сервера, а також не знання правил сервера не звільняє від відповідальності за їх порушення.",
        punishment: "Попередження або кік."
      },
      {
        title: "Стаття 1.2.",
        text: "Кожен громадянин зобов'язаний виконувати законні вимоги співробітників правоохоронних органів під час RolePlay - ситуацій. Навмисне ігнорування, відмова від виконання законних вимог без RP - причини або перешкоджання виконанню службових обов'язків правоохоронців забороняються.",
        punishment: "Кік. За повторне або систематичне порушення — бан від 1 до 3 днів."
      }
    ]
  },
  {
    number: 2,
    title: "Зовнішній вигляд",
    articles: [
      {
        title: "Стаття 2.1. Ігровий нікнейм",
        text: "Гравець зобов'язаний використовувати коректний та читабельний нікнейм. Забороняється використовувати нікнейми, що містять нецензурну лексику, образи, провокації, надмірну кількість спеціальних символів або інший неприйнятний вміст.",
        punishment: "На розсуд адміністрації."
      },
      {
        title: "Стаття 2.2. Ігровий аватар",
        text: "Гравець зобов'язаний використовувати аватар, який не надає ігрової переваги. Забороняється використовувати надто великі або надто малі аватари, що змінюють стандартні хітбокси персонажа. Рекомендується використовувати стандартний аватар у форматі R6.",
        punishment: "Бан до 3 днів."
      },
      {
        title: "Стаття 2.3. Заборонені аватари",
        text: "Забороняється використовувати аватари, що містять або пропагують заборонену символіку, екстремістські ідеології, державу - агресора, терористичні організації, нацистську символіку або інший провокаційний контент. Українська символіка дозволяється.",
        punishment: "Бан від 2 днів до перманентного блокування акаунта."
      }
    ]
  },
  {
    number: 3,
    title: "Норми поведінки та взаємоповага",
    articles: [
      {
        title: "Стаття 3.1. Повага до гравців",
        text: "Кожен гравець зобов'язаний поважати інших учасників сервера. Забороняється принижувати, цькувати (булити), дискримінувати, провокувати або проявляти неповагу до окремого гравця чи групи гравців.",
        punishment: "Попередження або бан до 5 днів."
      },
      {
        title: "Стаття 3.2. Використання Voice Chat",
        text: "Забороняється вмикати гучну музику, сторонні звуки, пропагандистський контент, російську музику в будь - якому вигляді (виняток — російськомовні пісні українських виконавців із проукраїнською позицією).",
        punishment: "Бан до 5 днів."
      }
    ]
  },
  {
    number: 4,
    title: "Порушення RolePlay - процесу",
    articles: [
      {
        title: "Стаття 4.1. Нон-RP поведінка",
        text: "Забороняється виконувати дії, що суперечать логіці та реалістичності RolePlay - процесу. Будь - які вчинки, які не відповідають ролі персонажа або поточній RP-ситуації, вважаються нон-RP поведінкою.",
        punishment: "Попередження або бан від 2 до 5 днів — залежно від тяжкості."
      },
      {
        title: "Стаття 4.2. Рейди та масові вбивства",
        text: "Забороняється організовувати або участвувати у рейдах та масових вбивствах, які порушують правила RolePlay.",
        punishment: "Бан до 30 днів, залежно від тяжкості порушення."
      },
      {
        title: "Стаття 4.3. Відігрування RP-команд.",
        text: "Кожний гравець зобов'язаний дотримуватися RP-команд та правильно відігрувати свого персонажа.\n\n !me - команда для опису дій вашого персонажа, які неможливо побачити через ігрові механіки.\n\n !do - команда для опису стану персонажа, предметів або подій, які може побачити ваш персонаж.\n\n !d - Non-RP чат, який використовується для спілкування поза межами RolePlay.",
        punishment: "попередження або бан від 1 до 4 днів."
      },
      {
        title: "Стаття 4.4. Види порушень RolePlay (примітка)",
        text: "OOC — спілкування поза роллю.\n\n MG — використання позаігрової інформації.\n\n PG — нереалістичні дії.\n\nRDM — безпричинне вбивство.\n\n SK — вбивство одразу після спавну.\n\n NVL — ігнорування цінності життя.\n\n Breaking RP — вихід із ролі.\n\n RK — помста без RP-підстав.\n\n BunnyHop — нереалістичні стрибки.\n\n Cuff Rush — наручники без підстав.\n\n Combat Logging — вихід з гри під час RP.\n\n FailRP — грубе порушення RP-логіки.\n\n Exploiting — використання багів. Cheating — читерство.", 
        punishment: "-" 
      }
    ]
  },
  {
    number: 5,
    title: "Правила дорожнього руху (ПДР)",
    articles: [
      {
        title: "Стаття 5.1. Неправильне паркування",
        text: "Забороняється залишати транспортний засіб у місцях, не призначених для паркування: посеред дороги, на пішохідних переходах, перехрестях тощо.",
        punishment: "Евакуатор або кік."
      },
      {
        title: "Стаття 5.2. Необережне керування транспортом",
        text: "Забороняється необережне керування транспортним засобом, яке може створити аварійну ситуацію або призвести до дорожньо-транспортної пригоди (ДТП). До таких порушень належать небезпечні маневри, дрифт у громадських місцях, рух зустрічною смугою без RP-причини, навмисне блокування дорожнього руху, ігнорування дорожньої обстановки та інші дії, що свідчать про неуважність або недбалість водія.",
        punishment: "Тюремне покарання (IC), попередження, кік або бан від 1 до 3 днів."
      },
     {
        title: "Стаття 5.3. Ввімкнення фар на транспорті",
        text: "Кожний гравець забов'язаний умівкнути фари з 18:00 до 06:00, а також у разі поганої видимості (туман, дощ тощо).",
        punishment: "попередження."
      },
      {
        title: "Стаття 5.4. Приховування номерних знаків",
        text: "Забороняється будь-яким способом приховувати, закривати або унеможливлювати огляд чи зчитування номерних знаків транспортного засобу.",
        punishment: "Евакуатор."
      },
      {
        title: "Стаття 5.5. Перевага для екстрених служб",
        text: "Усі учасники дорожнього руху зобов'язані надавати перевагу транспортним засобам екстрених служб з увімкненими маячками чи сигналами. Блокування проїзду забороняється.",
        punishment: "Тюремне покарання (IC), кік або бан до 3 днів."
      }
    ]
  },
  {
    number: 6,
    title: "Шахрайство та безпека",
    articles: [
      {
        title: "Стаття 6.1. Шахрайство, обман, байтинг та дезінформація",
        text: "Забороняється обманювати інших гравців, видавати себе за правохоронця чи за іншу особу на сервері, проводити фальшиві угоди, фінансові махінації, поширювати неправдиву інформацію. Заборонені неправдиві виклики екстрених служб.",
        punishment: "Бан від 2 днів або тюремне покарання (IC)."
      },
      {
        title: "Стаття 6.2. Поширення персональних даних, шантаж та погрози",
        text: "Забороняється поширювати персональні дані інших осіб без їхньої згоди, здійснювати шантаж, погрожувати, вимагати конфіденційну інформацію або будь-яким способом порушувати безпеку та приватність гравців.\n\n Також забороняється видавати себе за адміністратора, працівника державного органу чи іншу особу з метою введення гравців в оману або отримання будь-якої вигоди.",
        punishment: "Бан на 90 днів, а також бан у групі сервера на 60 днів."
      }
    ]
  },
  {
    number: 7,
    title: "Використання зброї",
    articles: [
      {
        title: "Стаття 7.1. Незаконне зберігання зброї",
        text: "Забороняється зберігати або носити зброю без відповідної ліцензії чи інших законних підстав.",
        punishment: "Тюремне покарання (IC)."
      },
      {
        title: "Стаття 7.2. Незаконне зберігання зброї",
        text: "Забороняється володіти, зберігати або носити зброю без відповідної ліцензії чи інших законних підстав.",
        punishment: "Тюремне покарання (IC)."
      },
      {
        title: "Стаття 7.3. Носіння зброї в громадських місцях",
        text: "Забороняється відкрито носити або демонструвати зброю в громадських місцях без законних підстав чи відповідного дозволу.",
        punishment: "Тюремне покарання (IC)."
      },
      {
        title: "Стаття 7.4. Використання зброї в зелених зонах",
        text: "Забороняється використовувати або демонструвати зброю в зелених зонах, окрім випадків службових обов'язків правоохоронних органів.",
        punishment: "Тюремне покарання (IC), а за порушення RP-процесу — кік або бан на розсуд адміністрації."
      },
      {
        title: "Стаття 7.5. Неналежне використання своєї ліцензії на зброю",
        text: "Заброняється викоростання будь-якої ліцензії на зброю не за призначенням, зловживання правами, що надає ліцензія, або порушення умов її використання.",
        punishment: "Скасування ліцензії на зброю та тюремне покарання (IC)."
      },

    ]
  },
  {
    number: 8,
    title: "Контрольно-пропускні пункти та дорожні роботи",
    articles: [
      {
        title: "Стаття 8.1. Проїзд через контрольно-пропускні пункти",
        text: "Контрольно-пропускні пункти (КПП) дозволяється встановлювати лише за межами червоної зони, позначеної на фотографії.\n\n Право встановлювати контрольно-пропускні пункти (КПП) мають лише працівники Національної поліції України (НПУ) та спецпідрозділу КОРД. \n\n Під час проходження або проїзду через КПП всі учасники зобов'язані дотримуватися RP-логіки та виконувати законні вимоги уповноважених працівників.\n\n Забороняється перевищувати свої повноваження, ігнорувати RP-процес або навмисно зривати його. \n\n Забороняється встановлювати контрольно-пропускні пункти (КПП) у заборонених зонах.",
        punishment: "Кік або бан до 3 днів.",
        image: "https://i.postimg.cc/7LwZCYQy/image-(1).webp" //кпп.webp 
      },
      {
        title: "Стаття 8.2. Перешкоджання дорожнім роботам",
        text: "Забороняється перешкоджати працівникам Автодору під час ремонту доріг, встановлення світлофорів, дорожніх знаків тощо.",
        punishment: "Кік або бан на 1 день."
      }
    ]
  },
  {
    number: 9,
    title: "Корупція",
    articles: [
      {
        title: "Стаття 9.1. Хабарництво та посередництво у корупції",
        text: "Забороняється приймати, пропонувати або вимагати хабарі, а також виступати посередником під час їх передачі чи допомагати в ухиленні від відповідальності за корупційні дії. До корупційних правопорушень також належать незаконне використання службового становища, надання незаконних переваг окремим особам та будь-які інші дії, що суперечать принципам чесної державної служби.",
        punishment: "Тюремне покарання (IC)."
      },
      {
        title: "Стаття 9.2. Приховування корупції",
        text: "Забороняється приховувати факти корупції, сприяти їх приховуванню або умисно не повідомляти про відомі випадки корупції у фракціях. Якщо гравцю стало відомо про корупційні дії, він зобов'язаний повідомити про це ДБР або власника сервера.",
        punishment: "Тюремне покарання (IC)."
      }
    ]
  },
  {
    number: 10,
    title: "Бізнеси",
    articles: [
      {
        title: "Стаття 10.1. Відкриття бізнесу",
        text: "Кожен бізнес може бути відкритий лише після погодження з власником сервера.",
        punishment: "Бан до 10 днів."
      },
      {
        title: "Стаття 10.2. Діяльність бізнесу",
        text: "Бізнес зобов'язаний дотримуватися правил сервера. Якщо діяльність систематично порушує правила — адміністрація має право призупинити або закрити його.",
        punishment: "Тимчасове призупинення або закриття бізнесу."
      },
      {
        title: "Стаття 10.3. Відповідальність власника бізнесу",
        text: "Власник бізнесу несе відповідальність за дії працівників під час виконання службових обов'язків.",
        punishment: "Призупинення діяльності або закриття бізнесу."
      },
      {
        title: "Стаття 10.4. Використання бізнесу для порушення правил",
        text: "Забороняється використовувати бізнес для шахрайства, відмивання коштів, обходу правил сервера.",
        punishment: "Закриття бізнесу, а також бан від 3 до 14 днів."
      }
    ]
  },
  {
    number: 11,
    title: "Зелені зони",
    articles: [
      {
        title: "Стаття 11.1. Зелені зони",
        text: "До зелених зон належать: Лікарня, Пожежні частини, Спавни, Парки, Суд, Поліцейська дільниця, офіс ДБР. Заборонено використовувати зброю, погрожувати, вчиняти злочини.",
        punishment: "Кік або бан до 5 днів.",
        image: "https://i.postimg.cc/ZYFj3fR4/image.webp" //карта зелених зон karta.webp
      },
      {
        title: "Стаття 11.2. Перебування в зеленій зоні з розшуком",
        text: "Забороняється перебувати в зелених зонах з активним розшуком більше 2 хвилин. Виняток — якщо гравець під арештом чи доставлений правоохоронцями.",
        punishment: "Кік або бан до 3 днів."
      }
    ]
  },
  {
    number: 12,
    title: "Судова влада України (СВУ)",
    articles: [
      {
        title: "Стаття 12.1. Обов'язки судді",
        text: "Суддя зобов'язаний неупереджено розглядати справу, оцінювати докази та виносити справедливе рішення відповідно до правил сервера.",
        punishment: "Тимчасове відсторонення від посади або звільнення."
      },
      {
        title: "Стаття 12.2. Порядок у судовій залі",
        text: "Усі присутні судового розгляду зобов'язані дотримуватися порядку та поважати судовий процес. Забороняється перешкоджати роботі суду, перебивати суддю, обвинуваченого чи свідків.",
        punishment: "Кік."
      },
      {
        title: "Стаття 12.3. Обов'язки адвоката",
        text: "Адвокат зобов'язаний дотримуватися адвокатської таємниці, якісно представляти інтереси свого клієнта.",
        punishment: "Позбавлення адвокатської ліцензії до 14 днів."
      },
      {
        title: "Стаття 12.4. Обов'язки прокурора",
        text: "Прокурор зобов'язаний сумлінно виконувати обов'язки, надавати докази, обґрунтовувати обвинувачення. Заборонено приховувати докази чи діяти в інтересах підсудного.",
        punishment: "Тимчасове відсторонення від посади або звільнення."
      },
      {
        title: "Стаття 12.5. Судові ордери",
        text: "Суд має право видавати ордери правоохоронним органам за наявності достатніх доказів або обґрунтованої підозри. Ордер є офіційним дозволом суду на проведення окремих процесуальних дій.\n\n До судових ордерів належать: ордер на арешт, ордер на обшук, ордер на проникнення до приватної власності. Ордери оформлюються та видаються через офіційного бота @svu_orders_crp_bot.",
        punishment: "—"
      },
      {
        title: "Стаття 12.6. Обов'язковий судовий розгляд",
        text: "Кожна особа, затримана за підозрою у вчиненні кримінального правопорушення, повинна бути доставлена до суду для розгляду справи та винесення остаточного рішення суддею.",
        punishment: "Бан до 3 днів."
      }
    ]
  },
  {
    number: 13,
    title: "Ліцензії",
    articles: [
      {
        title: "Стаття 13.1. Ліцензії на зброю",
        text: "Ліцензія на зброю видається громадянам та працівникам правоохоронних органів і надає право законно володіти, зберігати та використовувати зброю виключно для самооборони або в інших випадках, передбачених Правилами сервера.\n\n Ліцензія на зброю (зберігання) видається виключно для законного зберігання зброї. Власник такої ліцензії має право використовувати зброю лише у випадку необхідної самооборони. Забороняється відкрито носити або демонструвати зброю в громадських місцях. \n\n Ліцензія на приховане носіння зброї видається переважно працівникам правоохоронних органів та іншим особам, визначеним адміністрацією сервера. Така ліцензія надає право приховано носити зброю під час виконання службових обов'язків або в інших випадках, передбачених Правилами сервера.",
        punishment: "скасування відповідної ліцензії на зброю."
      },
      {
        title: "Стаття 13.2. Ліцензія таксиста",
        text: "Ліцензія таксиста надає право здійснювати пасажирські перевезення на території сервера. Власник ліцензії зобов'язаний дотримуватися Правил дорожнього руху (ПДР), Правил сервера та виконувати свою діяльність відповідно до RP-логіки.",
        punishment: " анулювання ліцензії таксиста."
      },
      {
        title: "Стаття 13.3. Адвокатська ліцензія",
        text: "Адвокатська ліцензія надає право представляти інтереси громадян у судових процесах. Власник ліцензії зобов'язаний дотримуватися Правил сервера, правил Судової влади України (СВУ), зберігати адвокатську таємницю та сумлінно виконувати свої професійні обов'язки.",
        punishment: "позбавлення адвокатської ліцензії до 14 днів або назавжди — залежно від тяжкості порушення."
      },
      {
        title: "Стаття 13.4 Зловживання ліцензіями",  
        text: "Забороняється використовувати будь-яку ліцензію не за її призначенням, передавати її іншим особам, використовувати для обходу Правил сервера або зловживати правами, які вона надає.",
        punishment: "анулювання відповідної ліцензії"
      }
    ]
  },
];